package main

import (
	"encoding/json"
	"io"
	"io/ioutil"
	"math/rand"
	"os"
)

type connectionConfig struct {
	Host             string   `json:"host"`
	Port             int      `json:"port"`
	Ssl              bool     `json:"ssl"`
	Nick             string   `json:"nick"`
	NickServPASSWORD string   `json:"nickserv_password"`
	AutoJoin         []string `json:"autojoin"`
}

type clientConfig struct {
	AutoConnect     []*connectionConfig `json:"autoconnect"`
	HideHostnames   bool                `json:"hidehostnames"`
	HideJoinParts   bool                `json:"hidejoinparts"`
	ChatLogsEnabled bool                `json:"chatlogs"`
	Font            string              `json:"font"`
	FontSize        int                 `json:"fontsize"`
	Theme           string              `json:"theme"`
	TimeFormat      string              `json:"timeformat"`
	Version         string              `json:"version"`
	QuitMessage     string              `json:"quitmessage"`
}

func defaultClientConfig() *clientConfig {
	return &clientConfig{
		AutoConnect: []*connectionConfig{},
		TimeFormat:  "15:04",
		Version:     "chopsuey IRC " + VERSION_STRING + " https://github.com/dayvonjersen/chopsuey",
		QuitMessage: quitMessage[rand.Intn(len(quitMessage)-1)],
	}
}

func getClientConfig() (*clientConfig, error) {
	cfg := defaultClientConfig()

	f, err := os.Open("config.json")
	defer f.Close()
	if err != nil {
		return cfg, err
	}

	b, err := ioutil.ReadAll(f)
	if err != nil {
		return cfg, err
	}

	err = json.Unmarshal(b, &cfg)

	return cfg, err
}

func writeClientConfig() error {
	f, err := os.Create("config.json")
	if err == nil {
		b, err := json.MarshalIndent(clientCfg, "", "    ")
		if err != nil {
			return err
		}
		io.WriteString(f, string(b))
		f.Close()
	}
	return err
}

var quitMessage = []string{
	"ε=ε=ε=ε=ε=┌(；　・＿・)┘",
	"ε=ε=┏( >_<)┛",
	"ε=ε=ε=┌(๑ʘ∀ʘ)┘",
	"ε=ε=ε=ε=┏(;￣▽￣)┛",
	"ε=ε=ε=ε=ε=ε=┌(๑ʘ∀ʘ)┘",
	"ε＝┏(･ω･)┛",
	"ε=ε=ε=ε=ε=ε=┌(;￣◇￣)┘",
	"三┏ ( ˘ω˘ )┛",
	"₍₍ ᕕ(´◓⌓◔)ᕗ⁾⁾",
	"ε=┌(;･_･)┘",
	"ε=ε=ε=ε=ε=ε=┌(￣ー￣)┘",
	"└(>ω<。)┐-=≡",
	"ε=ε=ε=ε┏(●´Д｀●)┛",
	"ε=ε=┏( ・＿・)┛",
	"ᕕ( ◎_◎)ᕗ",
	"ε=ε=ε=ε=ε=ε=┏(*´∀｀)┛",
	"=ε=ε=ε=ε=┌(`;@@)┘",
	"┏( ゜)ਊ゜)┛",
	"ᕕ(╯°□°)ᕗ",
	"・・・・・・・┌|*´∀｀|┘",
	"ε=┏(*`＞ω<)┛",
	"===≡≡≡｡ﾟ┌(ﾟ´Д`ﾟ)┘ﾟ｡",
	"┏┃*･д┃┛",
	"┗(^o^　)┓三",
	"┌（・Σ・）┘≡З",
	"ᕕ༼✿•̀︿•́༽ᕗ",
	"C= C= C= C= C= C= C= C= C= ┌(;・ω・)┘",
	"ε＝ε＝ε＝ε＝ε＝┌┤￣￣（●●）￣￣├┘",
	"C= C= C= C= C= C= ┌(;･_･)┘ ））●",
	"ε===(っ≧ω≦)っ",
	"─=≡Σ((( つ•̀ω•́)つ",
	"ε=ε=(っ*´□`)っ",
	"─=≡Σ(([ ⊐•̀⌂•́]⊐",
	"ε=ε=(⊃≧□≦)⊃",
	"─=≡Σ((( つ◕ل͜◕)つ",
	"───==≡≡ΣΣ((( つºل͜º)つ",
	"─=≡Σ((( つ ◕o◕ )つ",
	"……..(((((￢￣▽￣)￢",
	"～(((((っ*´_⊃｀)っ",
	"-=≡Σ(((⊃ﾟ∀ﾟ)つ",
	"!!Σ≡≡≡((っ`･Å･)っ",
	"!!((((((っ;ﾟ∀ﾟ)っ",
	"ε==ε==(っ*｀oЗo*)っ",
	"≡≡≡(⊃´･Δ･`)⊃",
	"(((((っ－＿－)っ",
	"⊂(‘ω’⊂ )))Σ≡=─༄༅༄༅༄༅༄༅༄༅",
	"ε=ε=ε=ε=ε=ε=ε=ε= ━( ^O^)━",
	"⌒⌒　　　⌒ “⊂(　っ☉ω☉)っ",
	"！(∩ω)⊃ —==三 ⊂⌒っ´ㅅ)っ",
	"⊂＝⊂＝⊂(┛ﾟΘﾟ)┛",
	"ε-ε-ヾ(o´∀)ノ",
	"ε=(｡ﾉ･ω･)ﾉ",
	"ε=ε=ε=(#`・д・)/",
	"ε=ε=(ノ≧∇≦）ノ",
	"ε＝ε＝ヾ（（●・ω・）ﾉ",
	"٩(•౪•٩)三",
	"☆ヾ(･ε･*)ﾉﾞ =з=з=з",
	"ε=(ﾉo`･∀･)ﾉ",
	"ヾ(･c_,･｡) ﾉ =з =з= з",
	"♪ε=ε=ε=ﾍ(*≧∇)ﾉ~",
	"ε=ε=ε=(ﾉ≧∀)ﾉ",
	"ε=ε=ε=ε=ε” “(/*’-‘*)/",
	"(=(=(=(=(=(／(ｴ)￣)／",
	"C= C= C= C=@(/o･ｪ･o)@/",
	"ε≡(ノ´＿ゝ｀）ノ",
	"☆ﾐ(o*･ω･)ﾉ",
	"～(((((((っ´Ι`)ﾉ",
	"!!≡≡≡ﾍ(*-ω-)ﾉ",
	"ε=ε=ε=(#ﾉ~ω~)ﾉ",
	"☆⌒v⌒v⌒ヾ((｀･∀･´)ﾉ",
	"ε＝ε＝(((((○´3`)ﾉ",
	"ヾ(Ô‿Ô✾)ﾉ=з =з",
	"– =͟͟͞͞ =͟͟͞͞ ﾍ( ´Д`)ﾉ",
	"ε=ε=(怒ﾟДﾟ)ﾉ",
	"ヽ(￣д￣;)ノ=3=3=3",
	"ε=ε=ε=(۶•̀Д•́)۶",
	"ε＝ε＝ε＝(((((ﾉ｀･Д･)ﾉ",
	"(◞º❒º)◞₎₎(◟º❑º)◟⁾⁾➟➠➨",
	"ε=٩(●❛ö❛)۶",
	"≡≡≡=(ﾉTдT)ﾉ",
	"..･ヾ(。￣□￣)ﾂ",
	"⊂(ﾟДﾟ;⊂⌒`つ",
	"(c=(c=(c=(c=(ﾟﾛﾟ;c=",
	"ε=ε=ε=ε=ε=(o- -)o",
	"!!Σ(ﾟДﾟ;≡≡≡≡≡ヾ(;ﾟдﾟ)/",
	"ε＝ε＝ε＝┌(;ﾟдﾟ)┘",
	"≡┏|*´･Д･|┛",
	"ε=ε=εε=ε=ε=（　┯_┯）",
	"ε=ε=ε=(ﾉTдT)ﾉ",
	"～ε～ε～┌(|||´Д｀)ノ",
	"ε=ε=ε=┏(ﾟロﾟ;)┛",
	"ε=ε=ε=ε=＼(;´□｀)/",
	"C= C= C= C=(o>ﾛ)o",
	"ヽ(￣д￣;)ﾉ=3=3=3",
	"ε=ε=ε=ε=(ノ*´Д｀)ノ",
	"ε=ε=ε=ε=ε=ヾ(;ﾟﾛﾟ)ﾉ",
	"ε=ε=ε=ε=ε=(；ﾟロﾟ)",
	"⊂(ﾟДﾟ⊂⌒｀つ≡≡≡",
	"⌒Ｙ⌒Ｙ⌒ ヾ(ｏ´Д｀)ﾉ",
	"ε==ε==(ﾉ゜д゜)ﾂ",
	"ε=ε=ε=ε=ε=ヾ(；ﾟ(OO)ﾟ)ﾉ",
	"ε=ε=ε=(((怒ﾟДﾟ)ﾉﾉ",
	"ε=ε=ε=(*ﾉ´Д｀)ﾉﾟ",
	"ε=ε=(*ﾉ´Д`)ﾉ",
	"ヾ(￣Q￣ヾ))))ミ～～",
	"ε=ε=ε=ﾍ(* – -)ﾉ",
	"｡｡゛(ﾉ><)ﾉ",
	"ﾚ(ﾟ∀ﾟ;)ﾍ=З=З=З",
	"ε≡Ξ≡Ξ≡ヽ( ;￣〇￣)ﾉ",
	"ε＝（ﾉﾟдﾟ）ﾉ",
	"ε=ε=ε=┌(；´ﾟｪﾟ)┘",
	"γ⌒γ⌒γﾟ･*:.●　⊂(ﾟﾛﾟ⊂≡≡===",
	"C= C= C= C= C= C= 。・゜゜ヽ| ；∀；|ノ",
	"★⌒Ｙ⌒Ｙ⌒Ｙ⌒Ｙ⌒ ヾ(oﾟДﾟ)ﾉ",
	"===≡≡≡。゜┌(゜ฺДฺ)┘゜。",
	"=͟͟͞͞( ∩ ‘ヮ’=͟͟͞͞) ੭ु⁾⁾",
	"=͟͟͞͞=͟͟͞͞ ⊂(=͟͟͞͞=͟͟͞͞っ☉ω=͟͟͞͞☉)っ=͟͟͞͞",
	"=͟͟͞͞(꒪ᗜ꒪ ‧̣̥̇)!!!!=͟͟͞͞",
	"=͟͟͞͞( ๑⃙⃘°◊°๑⃙⃘ )",
	"῍̩̖̬ ̎ ̎=͟͟͞͞(꒪ͦ॓ ˈ̫̮ ꒪ͦ॔)=͟͟͞͞८ಯು✧",
	"=͟͟͞͞(๑•̀ㅁ•́ฅ✧",
	"┗=͟͟͞͞( ˙∀˙)=͟͟͞͞┛",
	"(ृ°͈꒳​°͈ ृ =͟͟͞͞)ु≡:*・.*",
	"=͟͟͞͞( •̀д•́)))",
	"ਭ३౽=͟͟͞͞(((ഽʻ⁸ʻ)ഽ",
	"=͟͟͞͞(　 ω )=͟͟͞͞　³ ³",
	"三=͟͟͞͞( ∩ ‘ヮ’=͟͟͞͞) ੭ु⁾⁾",
	"=͟͟͞͞ (০͂ ̵̻০͂)ԓ",
	"=͟͟͞͞≠⌓̈⃝\\ᵒᵐᵍ",
	"一二三☞ ´◔‿ゝ◔ `)☞",
	"─=≡Σ((((͡◔ ͜ʖ ͡◔)",
	"─=≡Σ((((ó ì_í)=ó",
	"三三三ʅ(；◔౪◔)ʃ",
	"૮(”ړ ა)͞=͟͟͞͞=͟͟͞͞=͟͟͞͞=͟͟͞͞=͟͟͞͞=͟͟͞͞ #",
	"ΣΣ≡≡≡ｰ(ｰ・ω･)ｰ",
	"｢(◔ω◔「)三",
	"｢(⑅◔ω◔「)三",
	"(’ω’ ⊃)⊃三二一",
	"ε=ε=ε=ε=ε=ε= ◟( ͈ω̤)◞",
}
